import React from "react";
import "./Scss/Header.scss";

function Header() {
  return (
    <div className="Header">
      <div className="wrapper">
        <div className="header">
          <p className="lorem">
            <p className="title">
              <b> 1. ПРЕДМЕТ ДОГОВОРА. </b>
            </p>
            1.1. Предметом настоящего Договора является товар наименование,
            количество и комплектность которого указываются в акте
            приема-передачи. <br />
            1.2. Продавец обязуется передать Покупателю в собственность Товар на
            условиях рассрочки платежа, а Покупатель обязуется принять и
            оплатить Товар в порядке, предусмотренном настоящим договором.
            <br />
            1.3. Цена товара определяется исходя из прейскуранта цен на товар,
            действующего у Продавца на день заключения договора. <br />
            1.4. Общая стоимость Товара по настоящему Договору составляет сум.
            <br />
            1.5 Продажа товара осуществляется с условием оплаты Покупателем
            товара в рассрочку в порядке, установленном настоящим Договором.
            <br />
            1.6 Детальное описание, количество единиц и спецификации Товара
            содержится в Приложение № 1, которая является неотъемлемой частью
            настоящего Договора. <br />
            1.6. Покупателю предоставляется рассрочка платежа на условиях
            установленных Графиком платежей. <br />
            1.7. Покупатель имеет право на досрочное погашение оставшейся
            стоимости товара либо продавец оставляет за собой право осуществить
            перерасчет оставшейся не оплаченной суммы. <br />
            1.8. В случае Покупателем неисполнение в полном объеме свои
            обязательства по оплате стоимости товара на условиях, изложенных в
            настоящем договоре, Продавец имеет право требовать досрочного
            погашения оставшейся стоимости товара. Об сроках досрочного
            погашения оставшейся стоимости товара Продавец оповестит Покупателя
            посредством звонка и SMS сообщения на контактный номер телефона
            Покупателя. <br />
            1.9. Оплата стоимости товара на условиях рассрочки осуществляется
            ежемесячно в срок не позднее 15 числа путем внесения денежных
            средств. <br />
            При внесении денежных средств на расчетный счет Продавца расходы за
            перечисление несет Покупатель. <br />
            1.10. С момента передачи Товара Покупателю и до его полной оплаты
            Товар, проданный в рассрочку, находится в залоге у Продавца с местом
            нахождением Товара у Покупателя. <br />
            1.11. Оплата по настоящему договору производится путем: <br />
            - наличными денежными средствами непосредственно к Продавцу; <br />
            - перевода с банковской карты через терминал, интернет; <br />
            - безакцептного списание денежных средств с банковской карты
            Покупателя. <br />
            1.12. При заключении настоящего Договора Покупатель предоставляет
            продавцу (согласно Приложению №2 настоящего договора): <br />
            - полное и безоговорочное согласие на безакцептное списание денежных
            средств с его любых банковских карт для погашения задолженности
            перед продавцом; <br />
            - сведения о принадлежащей ему банковской карте. <br />
            1.13. Продавец самостоятельно организует техническое обеспечение
            безакцептного списания денежных средств с банковской карты
            Покупателя для погашения его задолженности. <br />
            1.14. Право на безакцептное списание возникает у Продавца в случае
            просрочки платежа Покупателем и только для взимания суммы
            задолженности Покупателя перед продавцом. <br />
            1.15. Принимая во внимание вышеуказанное, Стороны определили, что
            безакцептное списание денежных средств с его банковской карты для
            погашения задолженности перед Продавцом не является
            несанкционированным использованием банковской карты и не является
            несанкционированным платежом. <br />
            1.16. Право Продавца на безакцептное списание денежных средств с
            банковской карты Покупателя прекращается после полного погашения
            Покупателя перед Продавцом по заключенному между ними договору.
            <br />
            1.17. О факте списание денежных средств с банковской карты
            Покупатель информируется посредством SMS-уведомления при условии,
            если услуга SMS-информирования была подключена к номеру мобильного
            телефона Покупателя. <br />
            <p className="title">
              <b> 2. ПОРЯДОК ПРИЕМКИ И ПЕРЕДАЧИ ТОВАРОВ </b>
            </p>
            2.1. Продавец передает Покупателю товар, количество и комплектация
            которого оговорены подпунктом 1.1 Раздела 1 настоящего Договора при
            условии исполнения Покупателем положения подпункта 1.6. настоящего
            Договора. Одновременно с товаром Продавец передает Покупателю
            документы, относящиеся к товару. <br />
            2.2. Приемка товара осуществляется Покупателем по месту нахождения
            Продавца: г. Ташкент, Юнусабадский район, квартал 19, дом 1. <br />
            2.3. Обязанность Продавца по передаче товара считается выполненной,
            а риск случайной гибели или повреждения товара переходит на
            Покупателя в момент передачи товара Покупателю. <br />
            <p className="title">
              <b>3. ГАРАНТИЙНЫЕ ОБЯЗАТЕЛЬСТВА </b>
            </p>
            3.1. Продавец гарантирует качество передаваемого Покупателю Товара.
            <br />
            3.2. Гарантийный срок на Товар устанавливается Продавцом и
            составляет: <br />
            o 1 месяц; 3.3. Течение гарантийного срока начинается со дня
            передачи Продавцом товара Покупателю. <br />
            <p className="title">
              <b>4. ПРАВА И ОБЯЗАННОСТИ СТОРОН </b>
            </p>
            4.1. Продавец обязан: передать Покупателю Товар в день заключения
            настоящего договора. Передача Товара оформляется актом
            приема-передачи. в письменной или устной форме информировать
            Покупателя о возникновении просрочки в погашении им долга.
            информировать Покупателя об изменениях в нормативно-правовых
            документах и внутренних нормативных документах Продавца по вопросам
            расчетов. Продавец обязан предоставить Покупателю копию следующих
            документов бесплатно (один раз в рамках одного договора): документ
            (справка), подтверждающий, что обязательства потребителя по
            договорам выполнены полностью, Заявление Покупателя и другие
            документы. <br />
            4.2. Покупатель обязан: принять товар в соответствии с условиями
            настоящего договора; исполнить в полном объеме свои обязательства по
            оплате стоимости товара на условиях, изложенных в настоящем
            договоре. по первому требованию Продавца представлять информацию (в
            т.ч., документы), необходимую для определения платежеспособности
            Покупателя. заблаговременно не позднее сроков и при любых
            обстоятельств, обеспечивать наличие на своем пластиковом карте суммы
            денег, необходимой для погашения суммы кредита, подлежащих оплате
            согласно условиям настоящего Договора. своевременно извещать
            Продавца обо всех обстоятельствах, способных повлиять на
            своевременное и полное погашение кредита, а также на надлежащее
            исполнение иных обязательств Покупателя по настоящему Договору. не
            предпринимать действий, которые могут усложнить надлежащее
            выполнение условий настоящего Договора. уведомить Продавца об
            изменении контактной информации, используемой для связи с ним, об
            изменении способа связи Продавца с ним путем предоставления или
            направления Продавцу письменного уведомления произвольной формы в
            трехдневный срок с момента изменения соответствующих данных
            Покупателя. по первому требованию Продавца возместить все расходы,
            понесенные Продавцом в результате несвоевременного и/или
            ненадлежащего исполнения Покупателем обязательств перед Продавцом. В
            случае досрочного расторжения настоящего договора, независимо от
            оснований и инициатора расторжения, Покупатель обязан: • погасить
            все свои обязательства перед Продавцом, возникшие в связи с
            заключением и исполнением настоящего договора; • вернуть Продавцу
            товара, полученные на основании настоящего договора, в полном объеме
            комплектаций.
            <p className="title">
              <b>5. ОТВЕТСТВЕННОСТЬ СТОРОН </b>
            </p>
            5.1. В случае неисполнения своих обязательств по настоящему договору
            стороны несут ответственность в соответствии с положениями
            настоящего Договора, а также действующим законодательством
            Республики Узбекистан. <br />
            5.2. Сторона, не исполнившая или ненадлежащим образом исполнившая
            обязательства по настоящему договору, обязана возместить другой
            стороне причиненные таким неисполнением убытки. <br />
            5.3. За нарушение Графика платежей Покупатель неуплачивает Продавцу
            пеню или штраф <br />
            5.4. Любое из описанных в настоящем пункте событий, будет являться
            случаем неисполнения обязательств: <br />
            - Покупатель не осуществил платежи по рассрочку, в надлежащую дату,
            установленную в настоящем Договоре, а также прочим договорам,
            заключение которых было оговорено настоящим Договором; <br />-
            Ухудшение финансового состояния Покупателя или сокрытие точной
            информации, приводящей к неисполнениям обязательств по Договору;
            <br />
            - Другие события, которые могут повлиять на исполнение обязательств
            Покупателя перед Продавцом; <br />
            - Нарушение других условий настоящего Договора, отрицательно
            влияющих на возвратность рассрочки. <br />
            <p className="title">
              <b> 6. ФОРС-МАЖОР </b>
            </p>
            6.1. Стороны освобождаются от ответственности за частичное или
            полное неисполнение обязательств по настоящему договору, если это
            неисполнение явилось следствием возникших после заключения
            настоящего договора обстоятельств непреодолимой силы, которые
            Стороны не могли предвидеть или предотвратить. То есть чрезвычайных
            и непредотвратимых при данных условиях обстоятельств, под которыми
            понимаются: запретные действия властей, гражданские волнения,
            эпидемии, блокада, эмбарго, землетрясения, наводнения, пожары или
            другие стихийные бедствия. <br />
            6.2. Стороны освобождаются от ответственности за неисполнение или
            ненадлежащее исполнение своих обязательств по настоящему договору,
            если причиной такого неисполнения являются обстоятельства
            непреодолимой силы (форс-мажор) (выбрать нужное): землетрясения,
            наводнения, другие стихийные бедствия, массовые беспорядки,
            забастовки, другие обстоятельства чрезвычайного характера, которые
            стороны не могли предвидеть или предотвратить. <br />
            6.3. При наступлении обстоятельств, указанных в п. 6.1, Сторона, на
            невозможность исполнения обязательств которой по данному Договору
            влияют такие обстоятельства, должна без промедления известить о них
            в письменном виде другую Сторону. Извещение должно содержать данные
            о характере обстоятельств, а также официальные документы,
            удостоверяющие наличие этих обстоятельств и, по возможности, дающие
            оценку их влияния на исполнение Стороной своих обязательств по
            настоящему договору. <br />
            6.4. В случаях наступления обстоятельств, предусмотренных в п. 5.5.,
            срок выполнения Стороной обязательств по настоящему договору
            отодвигается соразмерно времени, в течение которого действуют эти
            обстоятельства и их последствия. <br />
            6.5. В случае, если продолжительность действия указанных в п. 5.5.
            обстоятельств превышает 90 дней, исчисляемый в днях, Продавец вправе
            досрочно расторгнуть Договор и имеет право взыскать долга досрочно в
            полном объеме. <br />
            <p className="title">
              <b> 7. ПОРЯДОК РАЗРЕШЕНИЯ СПОРОВ </b>
            </p>
            7.1. Все споры, которые могут возникнуть между сторонами по
            настоящему договору, стороны будут стремиться разрешить путем
            переговоров, либо путем предъявления претензии в письменной форме.
            <br />
            7.2. Споры, связанные с применением ЭЦП при заключении договоров,
            хранении электронных документов и информации, содержащейся в
            электронных сообщениях, применяемых в электронной коммерции,
            разрешаются в порядке, установленном законодательством. <br />
            7.3. В случае недостижения соглашения по спору, стороны имеют право
            обратиться согласно по Закону «О Нотариате» в нотариус или в суд в
            соответствии с действующим законодательством Республики Узбекистан.
            <br />
            7.4. Спорные вопросы, возникающие в ходе выполнения Договора,
            рассматриваются в соответствии с действующим законодательством
            Республики Узбекистан. При обращении в суд, споры передаются в
            межрайонный гражданский суд по месту нахождения Продавца. <br />
            <p className="title">
              <b> 8. СРОК ДЕЙСТВИЯ ДОГОВОРА, ПРОЧИЕ УСЛОВИЯ </b>
            </p>
            8.1. Настоящий Договор вступает в силу с момента его подписания и
            действует до полного исполнения сторонами своих обязательств. <br />
            8.2. Настоящий Договор заключен в двух подлинных экземплярах на
            русском языке, имеющих одинаковую юридическую силу, по одному
            экземпляру для каждой стороны. Все изменения, дополнения, приложения
            к настоящему договору действительны, если они совершены в письменной
            форме и подписаны каждой из сторон. <br />
            <p className="title">
              <b> 9. ПРОЧИЕ УСЛОВИЯ </b>
            </p>
            9.1. Покупатель не вправе передавать свои права и обязанности по
            настоящему Договору третьей стороне без письменного согласия на это
            Продавца. <br />
            9.2. В случаях, не предусмотренных настоящим Договором, стороны
            будут руководствоваться действующим законодательством Республики
            Узбекистан. <br />
            9.3. Изменение и расторжение Договора допускаются по соглашению
            Сторон, а также в случаях, предусмотренных настоящим
            договором-оферты и действующим законодательством Республики
            Узбекистан. <br />
            9.4. Если какое-либо из условий настоящего Договора признано
            недействительным или незаконным, либо не может вступить в силу в
            соответствии с действующим законодательством Республики Узбекистан,
            такое положение настоящего Договора будет заменено новым положением,
            максимально отвечающим изначальным намерениям, содержавшимся в ней,
            при этом остальные положения настоящего Договора не меняются и
            остаются в силе. <br />
            9.5. Для предоставления рассрочки Покупатель предоставляет право
            Продавцу на сбор, систематизацию, хранению, изменению, дополнению,
            использованию, предоставлению, распространению, передаче,
            обезличиванию и уничтожению своих персональных своих данных, а
            также, любым другим компаниям и третьим лицам, с которыми Продавец
            заключил соответствующие соглашения, договоры в рамках
            предоставления рассрочки. <br />
            <p className="title">
              <b> 10. ПРИЛОЖЕНИЯ </b>
            </p>
            10.1. Неотъемлемой частью настоящего договора является: <br />
            10.1.1. АКТ приема- передачи товара; <br />
            10.1.2. Согласия клиента на сбор и обработку персональных данных.
            <br />
          </p>
          <div className="link">
            <a
              href="https://docs.google.com/document/d/1Pif3kQK4Haye_y-s6MiOWWH6E-jwe6Rv/edit?usp=sharing&ouid=111248233946424406737&rtpof=true&sd=true"
              target={"_blank"}
            >
              Ofertani toliq o'qish
            </a>
          </div>
          <div className="check">
            <input type="checkbox" name="oferta" id="oferta" />
            <label htmlFor="oferta" className="ofertaText">
              Ommaviy ofertaga rozi bo'lish
            </label>
          </div>
        </div>
      </div>
    </div>
  );
}

export default Header;
